{
  "Recs": [
    {
      "RecipeName": "SunnySideUpEggs",
      "RequiredIngs": [
        {
          "FoodName": "Eggs",
          "IsUsed": "False"
        },
        {
          "FoodName": "Butter",
          "IsUsed": "False"
        }
      ],
      "ListofSteps": [
        "Step 1: Add water to a non-stick skillet until it reaches about 1/4",
        "inch deep. Heat skillet over medium heat\n You'll want the water to cover the egg white and reach just",
        "to the egg yolk.\n You don't want the water to cover the egg yolk at all.",
        "Step 2: Break the egg and add to the skillet, when the water\n begins to bubble slightly.",
        "Step 3: Using a large spoon, ladle water atop the egg white if the \nwater begins to reduce while cooking.",
        "Step 4: Cook until the egg white is perfectly opaque and the egg\n is firm as you shake the skillet slightly.",
        "Step 5: Use a slotted spatula and carefully lift the egg from the\nskillet,allowing any of the water to drain\nfrom the egg before plating."
      ]
    },
    {
      "RecipeName": "Vanilla Milkshake",
      "RequiredIngs": [
        {
          "FoodName": "Vanilla Ice Cream",
          "IsUsed": "False"
        },
        {
          "FoodName": "Milk",
          "IsUsed": "False"
        },
        {
          "FoodName": "Vanilla",
          "IsUsed": "False"
        }
      ],
      "ListofSteps": [
        "Blend\n-1 pint vanilla ice cream\n-1/4 cup milk\n-1 teaspoon vanilla \nsalt is not required but maybe added and if you do so its a pinch"
      ]
    },
    {
      "RecipeName": "Krabby Patty Recipe",
      "RequiredIngs": [
        {
          "FoodName": "Secret Maybe?",
          "IsUsed": "False"
        },
        {
          "FoodName": "Beef",
          "IsUsed": "False"
        },
        {
          "FoodName": "Cheese",
          "IsUsed": "False"
        }
      ],
      "ListofSteps": [
        "Grill the patties until they are almost cooked through.",
        "Add the cheese on top and cook until melted.",
        "Spread the mustard and ketchup on the buns.",
        "Put a patty on top of each.",
        "Add the lettuce, tomatoes, pickles, and onion.",
        "Top with the top bun and serve"
      ]
    },
    {
      "RecipeName": "Garlic Chicken",
      "RequiredIngs": [
        {
          "FoodName": "Chicken",
          "IsUsed": "False"
        },
        {
          "FoodName": "Stove",
          "IsUsed": "False"
        }
      ],
      "ListofSteps": [
        "Melt butter in a large skillet over medium high heat.",
        "Add chicken and sprinkle with garlic powder, seasoning salt and onion powder.",
        "Saute about 10 to 15 minutes on each side, or until chicken is cooked through and juices run clear."

      ]
    },
    {
      "RecipeName": "Stuffed Peppers",
      "RequiredIngs": [
        {
          "FoodName": "Green Pepper",
          "IsUsed": "False"
        },
        {
          "FoodName": "Stove",
          "IsUsed": "False"
        },
        {
          "FoodName": "Red Pepper",
          "IsUsed": "False"
        },
        {
          "FoodName": "Bell Pepper",
          "IsUsed": "False"
        },
        {
          "FoodName": "Sauce",
          "IsUsed": "False"
        }
      ],
      "ListofSteps": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place the rice and water in a saucepan, and bring to a boil.",
        "Reduce heat, cover, and cook 20 minutes. In a skillet over medium heat,",
        "cook the beef until evenly browned.",
        "Remove and discard the tops, seeds, and",
        "membranes of the bell peppers. Arrange peppers",
        "in a baking dish with the hollowed sides facing upward.",
        "(Slice the bottoms of the peppers if necessary \nso that they will stand upright.)",
        "In a bowl, mix the browned beef, cooked rice, 1 can tomato sauce,",
        "Worcestershire sauce, garlic powder, onion powder, salt, and pepper.",
        "Spoon an equal amount of the mixture into each hollowed pepper.",
        "Mix the remaining tomato sauce and Italian seasoning in a bowl,",
        "and pour over the stuffed peppers. Bake 1 hour in the preheated oven,",
        "basting with sauce every 15 minutes, until the peppers are tender."

      ]
    }
  ]
}
